; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 10 parts and 150% wood
; Machines:
;   3 highspeed-saw
;   3 glazer
;   3 grinder
;   3 immersion-varnisher
;   3 planer
;   3 saw
;   3 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 highspeed-saw2 - highspeed-saw
    glazer0 glazer1 glazer2 - glazer
    grinder0 grinder1 grinder2 - grinder
    immersion-varnisher0 immersion-varnisher1 immersion-varnisher2 - immersion-varnisher
    planer0 planer1 planer2 - planer
    saw0 saw1 saw2 - saw
    spray-varnisher0 spray-varnisher1 spray-varnisher2 - spray-varnisher
    white blue green mauve red black - acolour
    teak mahogany - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - part
    b0 b1 b2 b3 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (boardsize-successor s9 s10)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (empty highspeed-saw2)
    (has-colour glazer0 green)
    (has-colour glazer0 blue)
    (has-colour glazer1 white)
    (has-colour glazer1 red)
    (has-colour glazer2 white)
    (has-colour glazer2 red)
    (has-colour glazer2 blue)
    (has-colour immersion-varnisher0 black)
    (has-colour immersion-varnisher0 green)
    (has-colour immersion-varnisher0 blue)
    (has-colour immersion-varnisher0 mauve)
    (has-colour immersion-varnisher1 black)
    (has-colour immersion-varnisher1 green)
    (has-colour immersion-varnisher1 blue)
    (has-colour immersion-varnisher2 green)
    (has-colour immersion-varnisher2 mauve)
    (has-colour spray-varnisher0 black)
    (has-colour spray-varnisher0 green)
    (has-colour spray-varnisher0 blue)
    (has-colour spray-varnisher1 green)
    (has-colour spray-varnisher1 mauve)
    (has-colour spray-varnisher2 black)
    (has-colour spray-varnisher2 green)
    (has-colour spray-varnisher2 blue)
    (has-colour spray-varnisher2 mauve)
    (unused p0)
    (goalsize p0 large)
    (= (spray-varnish-cost p0) 15)
    (= (glaze-cost p0) 20)
    (= (grind-cost p0) 45)
    (= (plane-cost p0) 30)
    (unused p1)
    (goalsize p1 small)
    (= (spray-varnish-cost p1) 5)
    (= (glaze-cost p1) 10)
    (= (grind-cost p1) 15)
    (= (plane-cost p1) 10)
    (unused p2)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (unused p3)
    (goalsize p3 large)
    (= (spray-varnish-cost p3) 15)
    (= (glaze-cost p3) 20)
    (= (grind-cost p3) 45)
    (= (plane-cost p3) 30)
    (unused p4)
    (goalsize p4 large)
    (= (spray-varnish-cost p4) 15)
    (= (glaze-cost p4) 20)
    (= (grind-cost p4) 45)
    (= (plane-cost p4) 30)
    (available p5)
    (treatment p5 colourfragments)
    (surface-condition p5 rough)
    (wood p5 mahogany)
    (colour p5 blue)
    (goalsize p5 medium)
    (= (spray-varnish-cost p5) 10)
    (= (glaze-cost p5) 15)
    (= (grind-cost p5) 30)
    (= (plane-cost p5) 20)
    (available p6)
    (treatment p6 colourfragments)
    (surface-condition p6 smooth)
    (wood p6 teak)
    (colour p6 blue)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 large)
    (= (spray-varnish-cost p7) 15)
    (= (glaze-cost p7) 20)
    (= (grind-cost p7) 45)
    (= (plane-cost p7) 30)
    (unused p8)
    (goalsize p8 small)
    (= (spray-varnish-cost p8) 5)
    (= (glaze-cost p8) 10)
    (= (grind-cost p8) 15)
    (= (plane-cost p8) 10)
    (unused p9)
    (goalsize p9 small)
    (= (spray-varnish-cost p9) 5)
    (= (glaze-cost p9) 10)
    (= (grind-cost p9) 15)
    (= (plane-cost p9) 10)
    (boardsize b0 s10)
    (wood b0 teak)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s7)
    (wood b1 teak)
    (surface-condition b1 smooth)
    (available b1)
    (boardsize b2 s3)
    (wood b2 teak)
    (surface-condition b2 rough)
    (available b2)
    (boardsize b3 s6)
    (wood b3 mahogany)
    (surface-condition b3 rough)
    (available b3)
  )
  (:goal
    (and
    (available p0)
    (treatment p0 varnished)
    (colour p0 green)
    (available p1)
    (treatment p1 varnished)
    (colour p1 black)
    (available p2)
    (treatment p2 varnished)
    (wood p2 teak)
    (colour p2 blue)
    (available p3)
    (treatment p3 glazed)
    (surface-condition p3 smooth)
    (colour p3 white)
    (available p4)
    (wood p4 teak)
    (treatment p4 glazed)
    (surface-condition p4 smooth)
    (colour p4 blue)
    (available p5)
    (treatment p5 glazed)
    (surface-condition p5 verysmooth)
    (available p6)
    (wood p6 teak)
    (colour p6 green)
    (available p7)
    (treatment p7 glazed)
    (wood p7 teak)
    (surface-condition p7 verysmooth)
    (available p8)
    (treatment p8 glazed)
    (colour p8 red)
    (available p9)
    (treatment p9 varnished)
    (colour p9 mauve)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-large b1 p4 saw0 teak smooth s7 s5 s6 s4)
   deleted: (unused p4)
   added: (available p4) (wood p4 teak) (surface-condition p4 smooth) (colour p4 natural) (treatment p4 untreated) (boardsize b1 s4)
   goals met: 6 of 35
2. (do-saw-large b0 p3 saw0 teak rough s10 s8 s9 s7)
   deleted: (unused p3)
   added: (available p3) (wood p3 teak) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b0 s7)
   goals met: 7 of 35
3. (do-plane p5 planer0 rough blue colourfragments)
   deleted: (surface-condition p5 rough) (treatment p5 colourfragments) (colour p5 blue)
   added: (surface-condition p5 smooth) (treatment p5 untreated) (colour p5 natural)
   goals met: 7 of 35
4. (do-plane p3 planer0 rough natural untreated)
   deleted: (surface-condition p3 rough)
   added: (surface-condition p3 smooth)
   goals met: 8 of 35
5. (do-grind p6 grinder0 smooth blue colourfragments untreated)
   deleted: (surface-condition p6 smooth) (treatment p6 colourfragments) (colour p6 blue)
   added: (surface-condition p6 verysmooth) (treatment p6 untreated) (colour p6 natural)
   goals met: 8 of 35
6. (do-grind p5 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p5 smooth)
   added: (surface-condition p5 verysmooth)
   goals met: 9 of 35
7. (do-glaze p6 glazer0 green)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 glazed) (colour p6 green)
   goals met: 10 of 35
8. (do-glaze p5 glazer0 blue)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 glazed) (colour p5 blue)
   goals met: 11 of 35
9. (do-glaze p4 glazer0 blue)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 glazed) (colour p4 blue)
   goals met: 13 of 35
10. (do-glaze p3 glazer1 white)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 white)
   goals met: 15 of 35
11. (do-saw-large b0 p0 saw0 teak rough s7 s5 s6 s4)
   deleted: (unused p0)
   added: (available p0) (wood p0 teak) (surface-condition p0 rough) (colour p0 natural) (treatment p0 untreated) (boardsize b0 s4)
   goals met: 16 of 35
12. (do-plane p0 planer0 rough natural untreated)
   deleted: (surface-condition p0 rough)
   added: (surface-condition p0 smooth)
   goals met: 16 of 35
13. (do-immersion-varnish p0 immersion-varnisher0 green smooth)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 varnished) (colour p0 green)
   goals met: 18 of 35
14. (do-saw-large b0 p7 saw0 teak rough s4 s2 s3 s1)
   deleted: (unused p7)
   added: (available p7) (wood p7 teak) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b0 s1)
   goals met: 20 of 35
15. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 20 of 35
16. (do-grind p7 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p7 smooth)
   added: (surface-condition p7 verysmooth)
   goals met: 21 of 35
17. (do-glaze p7 glazer0 blue)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 blue)
   goals met: 22 of 35
18. (do-saw-medium b1 p2 saw0 teak smooth s4 s3 s2)
   deleted: (unused p2)
   added: (available p2) (wood p2 teak) (surface-condition p2 smooth) (colour p2 natural) (treatment p2 untreated) (boardsize b1 s2)
   goals met: 24 of 35
19. (do-immersion-varnish p2 immersion-varnisher0 blue smooth)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 varnished) (colour p2 blue)
   goals met: 26 of 35
20. (do-saw-small b0 p8 saw0 teak rough s1 s0)
   deleted: (unused p8)
   added: (available p8) (wood p8 teak) (surface-condition p8 rough) (colour p8 natural) (treatment p8 untreated) (boardsize b0 s0)
   goals met: 27 of 35
21. (do-glaze p8 glazer1 red)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 glazed) (colour p8 red)
   goals met: 29 of 35
22. (do-saw-small b1 p1 saw0 teak smooth s2 s1)
   deleted: (unused p1)
   added: (available p1) (wood p1 teak) (surface-condition p1 smooth) (colour p1 natural) (treatment p1 untreated) (boardsize b1 s1)
   goals met: 30 of 35
23. (do-immersion-varnish p1 immersion-varnisher0 black smooth)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 varnished) (colour p1 black)
   goals met: 32 of 35
24. (do-saw-small b1 p9 saw0 teak smooth s1 s0)
   deleted: (unused p9)
   added: (available p9) (wood p9 teak) (surface-condition p9 smooth) (colour p9 natural) (treatment p9 untreated) (boardsize b1 s0)
   goals met: 33 of 35
25. (do-immersion-varnish p9 immersion-varnisher0 mauve smooth)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 varnished) (colour p9 mauve)
   goals met: 35 of 35
